{"body":[{"section":"Hero","content":{"hed":"Tk","dek":"Tk"}},{"section":"Intro","content":[{"type":"Byline","value":{"text":"By <a href=https://pudding.cool/author/russell-samora target=_blank rel=noreferrer>Russell Samora</a> | October 2024"}},{"type":"text","value":"In a mesmerizing 56 seconds of the semifinals at the 2024 World Crokinole Championship, Connor Reinman and Jason Slater simultaneously secured perfect rounds."},{"type":"Video","value":{"src":"assets/videos/perfect.mp4","preload":"true","autoplay":"true","muted":"true","loop":"true","restart":"true","figcaption":"Double perfect round. Watch on <a href=https://www.youtube.com/watch?v=wVuA3B4zR7Q target=_blank rel=noreferrer>YouTube</a>."}},{"type":"text","value":"Technically speaking, they each flicked a 3.2cm disc 30cm across a board into a 3.5cm hole (just 9% wider than the disc itself) eight times in a row. In game terms, they made eight open 20s each; a rare gem of Crokinole perfection on display when the stakes couldn’t be higher."},{"type":"text","value":"How did we get here? How rare is a perfect round? Is Reinman vs. Slater the modern day Magic vs. Bird? Was this one of those obscure new Olympic events? You may even be wondering, “wtf is Crokinole?”"},{"type":"text","value":"If you find yourself sitting with any of these questions, then you’ve come to the right place."}]},{"section":"act1","content":[{"type":"h2","value":"20-second history"},{"type":"text","value":"If you are from the southern region of the Canadian province of Ontario, you may already be well-versed in Crokinole due to its <a href=https://www.canadashistory.ca/explore/arts-culture-society/crokinole target=_blank rel=no_referrer>likely Canadian origin.</a> But for the uninitiated, Crokinole is like a mashup of shuffleboard and curling, played on a tabletop board. It’s been around since the 19th century but has seen a steady rise in global popularity in recent years."},{"type":"Image","value":{"src":"assets/images/ontario.png","alt":"Map highlighting the southern region of Ontario","figcaption":"Map highlighting the southern region of Ontario"}},{"type":"h2","value":"30-second game overview"},{"type":"text","value":"Players take turns flicking discs toward the center, aiming to score high while knocking their opponent’s discs into lower zones or off the board. A shot must hit an opponent’s disc if one is present; otherwise, it must land in the inner circle (or score a 20 in the center hole). The round winner is whoever has the most points, and games consist of multiple rounds. <a href=https://youtu.be/R-6hdqdYPpE target=_blank rel=noreferrer>Watch this video</a> for a more thorough explanation of the rules."},{"type":"text","value":"<mark>[maybe work in a visual glossary with little video grid of examples]</mark>"},{"type":"h2","value":"The top players over the past decade"},{"type":"Image","value":{"src":"assets/images/bump.png","alt":"Bump chart of player rankings over the past 10 years","figcaption":"Player rankings according to <a href=http://crokinolereference.com/ target=_blank rel=noreferrer> Crokinole Reference.</a>"}},{"type":"text","value":"Connor Reinman, the back-to-back world champion, and Justin Slater, the perennial powerhouse, are arguably the greatest players on the Crokinole world stage right now."},{"type":"text","value":"But how good are they? Let's start by looking at their open 20 skills, an indispensable part of success."},{"type":"Table","value":{"caption":"Competitive players’ open 20 success rate","src":"competitive","note":"Minimum 50 attempts from the 2023-2024 season.","right":"1,2"}},{"type":"text","value":"Both Reinman and Slater are among the best competitive players at open 20s, making 66% and 75% respectively. An average competitive player makes around 55% of open 20s during in-game play."},{"type":"text","value":"To put this in perspective for some, a competitive player making eight consecutive 20s in live-game action is like an NBA player making 20 straight free throws during the course of a game (or games). Not impossible, but definitely not common either."},{"type":"h2","value":"But it’s just flicking a little disc across a small table. How hard can it be, right?"},{"type":"text","value":"Let's contextualize their skill by comparing it to some “ordinary” folks — a club of non-competitive players with experience ranging from a handful to hundreds of games played. In this group of 10 player observations, in-game open 20 success rates ranged from 25 to 60%."},{"type":"text","value":"Keep in mind that all of these percentages are based on in-game attempts, where a player’s open 20 rhythm is broken up by various other types of shots. In a vacuum, they can do some pretty impressive things. Take Shawn Hagarty for example, who recently set an unofficial world record of 64 straight open 20s."},{"type":"Video","value":{"src":"assets/videos/record.mp4","preload":"true","autoplay":"true","muted":"true","loop":"true","restart":"true","figcaption":"64 straight open 20s by Shaw Hagarty. Watch on <a href=https://www.youtube.com/watch?v=Lmp_-1ifOPc target=_blank rel=noreferrer>YouTube</a>."}},{"type":"text","value":"Back to our double perfect round. If we get a little mathy here, the odds of two players making eight in a row varies a lot based on skill level. Let’s look at different types of players in-game success rate to see what we can expect."},{"type":"Table","value":{"caption":"Odds of double perfect rounds","src":"odds","note":"Slater makes 75% and Reinman 66% of open 20s.","right":"1"}},{"type":"text","value":"Our theoretical scenarios give us a pretty good sense of the odds of seeing this phenomenon. It might seem surprising, but even a small drop in skill has a massive effect. We really need to have the best players in the world both hitting a hot streak at the same time to glimpse this rare event."},{"type":"text","value":"But real games are much more nuanced and complex. A player — or their opponent — often misses quite early. Here is what the data suggests after reviewing 300 rounds from dozens of matchups from the past season’s tournaments."},{"type":"Histogram","value":{"caption":"At Which Shot an Open 20 is First Missed in Competitive Matches","note":"Based on 300 rounds from final to quarterfinal matches in the past year."}},{"type":"text","value":"More often than not, the elusive double perfect round is out the window at the very start of a round. But I’ve been framing this under the most elegant form of a “pure” double perfect round – where all 16 20s are made via open 20s."},{"type":"text","value":"Technically speaking, a miss doesn’t fully close the door on a perfect round. A perfect round can (and often does) happen with a combination of open 20s and ricochet 20s (bouncing a disc in off the opponent’s). That opens up more complicated and exciting gameplay scenarios since going for a 20 may not be the best strategic choice."},{"type":"text","value":"But one thing remains clear; more skilled players are able to keep the number of discs on the board to a minimum and make open 20s at a higher rate, making it far more likely to see a pure double perfect round when two great players go against each other."},{"type":"text","value":"And no, Crokinole isn’t an Olympic sport. Yet."},{"type":"text","value":"For more analysis, check out <a href=https://public.tableau.com/app/profile/shawn.hagarty/viz/NCACrokinole20sStats/NCAAll20s target=_blank rel=noreferrer>Shawn Hagarty’s visualizations.</a>"},{"type":"Method","value":{"text":[{"type":"text","value":"Player types are estimations based on all open 20 success rates from 2023-2024 NCA tournament data. Recreational open 20 success rates are based on observations of 600 open 20 attempts from 10 individuals with at least 50 attempts each."}]}}]}]}