{"title":"Welcome to Crokinole, the greatest game you’ve never heard of.","description":"This isn’t just a flicking game, but a century-old test of skill and strategy.","url":"https://pudding.cool/2024/10/crokinole","body":[{"section":"story","content":[{"type":"Byline","value":{"text":"By <a href=https://pudding.cool/author/russell-samora target=_blank rel=noreferrer>Russell Samora</a> | October 2024"}},{"type":"text","value":"What you’re seeing below is two of Crokinole’s greats simultaneously securing perfect rounds."},{"type":"Video","value":{"src":"assets/videos/perfect.mp4","preload":"true","autoplay":"true","muted":"true","loop":"true","restart":"true","figcaption":"Double perfect round. Watch on <a href=https://www.youtube.com/watch?v=wVuA3B4zR7Q target=_blank rel=noreferrer>YouTube</a>."}},{"type":"text","value":"Technically speaking, they each flicked a 3.2cm disc 30cm across a board into a 3.5cm hole (just 9% wider than the disc itself) eight times in a row. In game terms, they made eight open 20s each."},{"type":"text","value":"<strong>But it’s just flicking a little disc across a small board. How hard can it be, really?</strong>"},{"type":"text","value":"The mesmerizing 56 seconds above were captured at the semifinals of the 2024 World Crokinole Championship, where Connor Reinman defeated Jason Slater. A matchup not unlike Magic vs. Bird, or Swift vs. Eilish."},{"type":"text","value":"How rare was this feat of perfection? Was this one of those obscure new Olympic events? You may even be wondering, wtf is Crokinole?"},{"type":"text","value":"We’ll get to all these questions. <strong>But first, you must understand Crokinole.</strong>"},{"type":"Image","value":{"src":"assets/images/ontario.jpg","alt":"Map highlighting the southern region of Ontario","figcaption":"The game’s origin: the southern region of Ontario."}},{"type":"text","value":"If you are from the southern region of the Canadian province of Ontario, you may already be well-versed in Crokinole due to its <a href=https://www.canadashistory.ca/explore/arts-culture-society/crokinole target=_blank rel=no_referrer>Canadian origin.</a> For the uninitiated, Crokinole is like a mashup of shuffleboard and curling, played on a tabletop board. It’s been around since the 19th century but has seen a steady rise in global popularity in recent years."},{"type":"text","value":"To know the game, one must play the game. <br><strong>Let your training begin.</strong>"},{"type":"Rules","value":{"steps":[{"id":"regions","text":"The main objective is to flick your discs into higher-scoring regions. <strong>The center hole is worth 20 points.</strong> Be careful, though—eight pegs surround the fifteen-point region."},{"id":"fifteen","text":"Here, <span class=opp>your opponent</span> shoots on an empty board. To be a valid shot (and stay on the board) the disc must land within the <span class=fifteen>15-point region.</span>"},{"id":"opponent","text":"If any <span class=opp>opponent discs</span> are on the board, <span class=you>your disc</span> must hit one to be valid and stay on the board."},{"id":"opponenttry","text":"<strong>Give it a try:</strong> Hit your <span class=opp>opponent’s disc.</span> Use the <strong>slider and button</strong> below the board to position your disc. Then aim, hold the shoot button to find the perfect power, and release."},{"id":"invalid","text":"If you shoot and it is an invalid shot, <span class=you>your disc</span> is removed from the board and is not scored."},{"id":"open","text":"It’s your turn, and there are <span class=opp>no opponent discs</span>. You just need to land in the fifteen-point region, <strong>but scoring a 20 is ideal.</strong> A made 20 is set aside and counted."},{"id":"opentry","text":"<strong>Give it a try:</strong> Shoot <span class=you>your disc</span> into the center hole to secure the 20 points."},{"id":"score","text":"After all sixteen discs are played, points are tallied based on the regions and any 20s. The round winner is the player with the most points, and a game consists of multiple rounds."}]}},{"type":"Video","value":{"src":"assets/videos/keanu.mp4","preload":"true","autoplay":"true","muted":"true","loop":"true"}},{"type":"text","value":"Easy Keanu, that was just the basics. We didn’t even get to the one-cheek rule (yes, that cheek). For more details you can <a href=https://youtu.be/R-6hdqdYPpE target=_blank rel=noreferrer>watch this video</a> or <a href=http://nationalcrokinoleassociation.com/resources/rules.html target=_blank rel=noreferrer>read the rules</a>."},{"type":"text","value":"Oh, and feel free to go play—we made <a href=play>a simulator</a> for you to hone your skills against a bot."},{"type":"text","value":"You are ready for the next part of the journey. <strong>What does the data tell us about Connor Reinman and Jason Slater?</strong>"},{"type":"text","value":"Reinman, the back-to-back world champion, and Slater, the perennial powerhouse, are arguably the greatest players right now on the world stage."},{"type":"Image","value":{"src":"assets/images/bump.png","alt":"Bump chart of player rankings over the past 10 years","figcaption":"Player rankings according to <a href=http://crokinolereference.com/ target=_blank rel=noreferrer> Crokinole Reference.</a> No matches from 2021-2022."}},{"type":"text","value":"But how good are they? Let’s start by looking at their ability to make open 20s, an indispensable skill for success. <strong>Here’s how competitive players compare in open 20 success rates.</strong>"},{"type":"text","value":"</strong>"},{"type":"Table","value":{"src":"competitive","note":"Minimum 50 attempts from the 2023-2024 season.","right":"1,2","highlight":"0,2"}},{"type":"text","value":"Reinman and Slater are top competitors in open 20s, with success rates of 66% and 75%, compared to the average competitive player’s 55%."},{"type":"text","value":"For basketball fans: a Crokinole player making eight consecutive 20s in live play is like an NBA player sinking 20 straight free throws during a game—not impossible, but far from common."},{"type":"text","value":"How do they compare to casual players? Observing 10 players with varying experience, success rates for in-game open 20s ranged from 25% to 60%."},{"type":"text","value":"The odds of two opponents making eight consecutive shots can vary greatly depending on their skill level. <strong>Here are the odds of a double perfect round.</strong>"},{"type":"Table","value":{"src":"odds","note":"Slater makes 75% and Reinman makes 66% on open 20s.","right":"1","highlight":"0"}},{"type":"text","value":"Our theoretical scenarios show how even a slight drop in skill greatly impacts the odds. To witness this rare event, both top players must hit a hot streak at the same time."},{"type":"text","value":"These percentages reflect in-game attempts, where a player’s rhythm is disrupted by various shots. In non-competitive, less plamigerent settings, their skills really shine—like Shawn Hagarty, who set an unofficial record with 64 consecutive open 20s."},{"type":"Video","value":{"src":"assets/videos/record.mp4","preload":"true","autoplay":"true","muted":"true","loop":"true","restart":"true","figcaption":"64 straight open 20s by Shaw Hagarty. Watch on <a href=https://www.youtube.com/watch?v=Lmp_-1ifOPc target=_blank rel=noreferrer>YouTube</a>."}},{"type":"text","value":"However, real games are far more nuanced and complex. Players — or their opponents — often miss early on. Here’s what the data reveals after analyzing 300 rounds from various matchups in last season’s tournaments."},{"type":"text","value":"<strong>At Which Shot an Open 20 is First Missed in Competitive Matches</strong>"},{"type":"Histogram","value":{"note":"Based on 300 rounds from final to quarterfinal matches in the past year."}},{"type":"text","value":"More often than not, the elusive double perfect round is lost right at the start. But I’ve been discussing this in the context of the most elegant form — a “pure” double perfect round, where all 16 shots are made as open 20s."},{"type":"text","value":"Technically, though, a miss doesn’t completely rule out a perfect round. A perfect round can (and often does) include a combination of open 20s and ricochet 20s, where a disc bounces in off the opponent’s."},{"type":"Video","value":{"src":"assets/videos/ricochet.mp4","preload":"true","autoplay":"true","muted":"true","loop":"true","restart":"true","figcaption":"Ricochet 20s by Justin Slater and Andrew Hutchinson. Watch on <a href=https://www.youtube.com/watch?v=Iyn64Sn_yqI target=_blank rel=noreferrer>YouTube</a>."}},{"type":"text","value":"The perfect blend of aim and power is required to perfect shots like those. Try it yourself: can you achieve the feel-good ricochet 20?"},{"type":"Situation","value":{"scenario":"ricochettry"}},{"type":"text","value":"Going for a 20 isn’t always the best or even a viable option. Discs on the board introduce more exciting scenarios that add layers of strategy."},{"type":"text","value":"Having all your discs on your side is usually a strong defensive position, but watching your opponent dismantle it can be demoralizing. That’s exactly what happened in this round between Andrew Hutchinson and Nolan Tracey."},{"type":"Video","value":{"src":"assets/videos/triple.mp4","preload":"true","autoplay":"true","muted":"true","loop":"true","restart":"true","figcaption":"Triple takeout by Nolan Tracey. Watch on <a href=https://www.youtube.com/watch?v=B3zaxfzEfXc target=_blank rel=noreferrer>YouTube</a>."}},{"type":"text","value":"The Slater-Reinman round was the only double perfect in a review of 445 highly competitive rounds in the past year. One thing is certain: more skilled players tend to keep the board clear and make open 20s at a higher rate, increasing the chance of glimpsing a pure double perfect round."},{"type":"text","value":"If there’s one takeaway, it’s that Crokinole is fun and the community is awesome. Whether you’re playing to win or just flicking a few rounds with Grandma during the holidays, it’s a great time."},{"type":"text","value":"<strong>So, maybe you’re into Crokinole now?</strong> Here are some resources to help you get started, or go get some practice in with <a href=play>the simulator</a>."},{"type":"Ul","value":{"list":["<a href=http://nationalcrokinoleassociation.com/clubs.html target=_blank rel=noreferrer>Find</a> a <a href=https://traceyboards.com/crokinole-connections-map/ target=_blank rel=noreferrer>club</a>","<a href=https://traceyboards.com/ target=_blank rel=noreferrer>Buy a Tracey board</a> (or <a href=https://muzzies.ca/ target=_blank rel=noreferrer>here</a>, <a href=https://www.browncastlegames.com/ target=_blank rel=noreferrer>here</a>, <a href=https://crokinole.ca/ target=_blank rel=noreferrer>here</a>)","<a href=https://www.youtube.com/@TraceyBoardsWatch target=_blank rel=noreferrer>Watch some matches</a>","<a href=https://www.youtube.com/watch?v=qyH7o1FYkcU target=_blank rel=noreferrer>Listen</a> to some <a href=https://www.youtube.com/watch?v=OF3JfiexLVA target=_blank rel=noreferrer>jams</a>","<a href=https://www.reddit.com/r/Crokinole/ target=_blank rel=noreferrer>/r/Crokinole</a>"]}},{"type":"Method","value":{"text":[{"type":"text","value":"<strong>Data and Methods</strong>"},{"type":"text","value":"Player types are estimations based on all open 20 success rates from 2023-2024 NCA tournament data. Competitive 20 success rates are from <a href=https://public.tableau.com/app/profile/shawn.hagarty/viz/NCACrokinole20sStats/NCAAll20s target=_blank rel=noreferrer>Shawn Hagarty’s impressive data.</a> Recreational open 20 success rates are based on observations of 600 open 20 attempts from 10 individuals with at least 50 attempts each. First missed shot data is from watching playoff-rounds from all 2023-2024 tournaments on <a href=https://www.youtube.com/@TraceyBoards target=_blank rel=noreferrer>Tracey Boards coverage</a> of events. Yearly NCA tour rankings data is based on the rank in July (at the end of the season). Data from <a href=http://crokinolereference.com/ target=_blank rel=noreferrer>Crokinole Reference.</a>"}]}}]}]}