{"body":[{"section":"Hero","content":{"hed":"Tk","dek":"Tk"}},{"section":"Intro","content":[{"type":"text","value":"In a mesmerizing 56 seconds of the semifinals at the 2024 World Crokinole Championship, Connor Reinman and Jason Slater both secured perfect games in the same round, sinking eight 20s each. A rare gem of Crokinole perfection on display when the stakes couldn’t be higher."},{"type":"component","value":{"name":"Video","src":"assets/videos/perfect.mp4","preload":"true","autoplay":"true","muted":"true","loop":"true","restart":"true"}},{"type":"text","value":"How did we get here? How rare is a perfect game? Is Slater vs. Reinman the modern day Magic vs. Bird? Was this one of those obscure new Olympic events? You may even be asking, wtf is Cronikole? If you find yourself sitting with any of these questions, then you’ve come to the right place."},{"type":"text","value":"<strong>This is everything about Crokinole</strong>. I am <a href=https://pudding.cool/author/russell-samora target=_blank rel=noreferrer>Russell Samora</a>. And you are reading this <span class=elapsed>now</span>. Read on for answers to all these questions, and much more."}]},{"section":"act1","content":[{"type":"text","value":"If you are from the Canadian Province of Ontario, you may already be well-versed in Crokinole. But for the uninitiated, Crokinole is like a mashup of Shuffleboard and Curling, played on a tabletop board. It’s been around since the 19th century, but has been seen a steady rise in global popularity in recent years."},{"type":"text","value":"<strong>A super quick overview of the game:</strong> Players take turns flicking discs toward the center, aiming to score high while knocking opponent discs into lower zones or off the board. A shot must hit an opponent’s disc if one is present; otherwise, it must land in the inner circle (or score a 20 in the center hole). The round winner is whoever has the most points, and games consist of multiple rounds. <a href=https://youtu.be/R-6hdqdYPpE target=_blank rel=noreferrer>Watch this video</a> for a more thorough rules explanation."},{"type":"text","value":"[learn the lingo - visual glossary]"},{"type":"text","value":"[top players / goat debate]"},{"type":"text","value":"[how good are they? 20s record, pros/joes data]"},{"type":"text","value":"[back to the perfect game, how rare is it?]"},{"type":"text","value":"[tournament 20s data vis]"},{"type":"text","value":"[deeper analytics (hammer advantage, 20s/points, first to miss, etc)]"}]}]}