{"body":[{"section":"Hero","content":{"hed":"Tk","dek":"Tk"}},{"section":"story","content":[{"type":"Byline","value":{"text":"By <a href=https://pudding.cool/author/russell-samora target=_blank rel=noreferrer>Russell Samora</a> | October 2024"}},{"type":"text","value":"What you’re seeing below is two of Crokinole’s greats simultaneously securing perfect rounds."},{"type":"Video","value":{"src":"assets/videos/perfect.mp4","preload":"true","autoplay":"true","muted":"true","loop":"true","restart":"true","figcaption":"Double perfect round. Watch on <a href=https://www.youtube.com/watch?v=wVuA3B4zR7Q target=_blank rel=noreferrer>YouTube</a>."}},{"type":"text","value":"Technically speaking, they each flicked a 3.2cm disc 30cm across a board into a 3.5cm hole (just 9% wider than the disc itself) eight times in a row. In game terms, they made eight open 20s each."},{"type":"text","value":"<strong>But it’s just flicking a little disc across a small board. How hard can it be, really?</strong>"},{"type":"text","value":"The mesmerizing 56 seconds above were captured at the semifinals of the 2024 World Crokinole Championship, where Connor Reinman defeated Jason Slater. A matchup not unlike Magic vs. Bird, or Swift vs. Eilish."},{"type":"text","value":"How rare was this feat of perfection? Was this one of those obscure new Olympic events? You may even be wondering, wtf is Crokinole?"},{"type":"text","value":"We’ll get to all these questions. <strong>But first, you must understand Crokinole.</strong>"},{"type":"Image","value":{"src":"assets/images/ontario.jpg","alt":"Map highlighting the southern region of Ontario","figcaption":"The game’s origin: the southern region of Ontario."}},{"type":"text","value":"If you are from the southern region of the Canadian province of Ontario, you may already be well-versed in Crokinole due to its <a href=https://www.canadashistory.ca/explore/arts-culture-society/crokinole target=_blank rel=no_referrer>Canadian origin.</a> For the uninitiated, Crokinole is like a mashup of shuffleboard and curling, played on a tabletop board. It’s been around since the 19th century but has seen a steady rise in global popularity in recent years."},{"type":"text","value":"To know the game, one must play the game. <br><strong>Let your training begin.</strong>"},{"type":"Rules","value":{"steps":[{"id":"regions","text":"The main objective is to flick your discs into higher-scoring regions. <strong>The center hole is worth 20 points.</strong>"},{"id":"open","text":"When the board is empty, <strong>the goal is to hit a 20</strong>. Made 20s are set aside and counted."},{"id":"opentry","text":"<strong>Try it yourself:</strong> shoot <span class=you>your disc</span> into the center hole. Hold the button below to find the ideal power for your shot."},{"id":"fifteen","text":"Here, <span class=opp>your opponent</span> misses the 20. But since <span class=you>none of your discs</span> are on, the shot is valid and remains as long as one of their discs lands inside the <span class=fifteen>15-point region.</span>"},{"id":"opponent","text":"If any of your <span class=opp>opponent’s discs</span> are on the board, one of <span class=you>your discs</span> must hit one of theirs. Where they end up doesn’t matter (yet)."},{"id":"opponenttry","text":"<strong>Try it yourself:</strong> hit your <span class=opp>opponent’s disc.</span> Bonus points if you keep yours on the board. Also note you can now (and always) place your disc before you shoot."},{"id":"invalid","text":"In case of any invalid shot, <span class=you>your disc</span> (and any others of yours it hit) are removed from the board."},{"id":"score","text":"After all discs are played, points are counted based on the regions plus any 20s. The round winner is whoever has the most points, and a game consists of multiple rounds."}]}},{"type":"Video","value":{"src":"assets/videos/keanu.mp4","preload":"true","autoplay":"true","muted":"true","loop":"true"}},{"type":"text","value":"Easy Keanu, that was just the basics. We didn’t even get to the one-cheek rule (yes, that cheek). <a href=https://youtu.be/R-6hdqdYPpE target=_blank rel=noreferrer>Watch this video</a> for a more thorough explanation of the rules."},{"type":"text","value":"You are ready for the next part of the Crokinole journey. <strong>Let’s see what the numbers tell us about Connor Reinman and Jason Slater.</strong>"},{"type":"text","value":"Reinman, the back-to-back world champion, and Slater, the perennial powerhouse, are arguably the greatest players right now on the world stage."},{"type":"Image","value":{"src":"assets/images/bump.png","alt":"Bump chart of player rankings over the past 10 years","figcaption":"Player rankings according to <a href=http://crokinolereference.com/ target=_blank rel=noreferrer> Crokinole Reference.</a> No matches from 2021-2022."}},{"type":"text","value":"But how good are they? Let's start by looking at their ability to make open 20s, an indispensable skill for success. <strong>Here is a comparison of competitive players’ open 20 success rates.</strong>"},{"type":"Table","value":{"src":"competitive","note":"Minimum 50 attempts from the 2023-2024 season.","right":"1,2","highlight":"0,2"}},{"type":"text","value":"Reinman and Slater are two of the top competitors when it comes to open 20s, with success rates of 66% and 75%, respectively. In comparison, the average competitive player makes about 55% of open 20s during gameplay."},{"type":"text","value":"If you are a basketball fan, this might put it in perspective: a competitive Crokinole player making eight consecutive 20s in live-game action is like an NBA player making 20 straight free throws during the course of a game (or games). Not impossible, but definitely not common either."},{"type":"text","value":"And how do they compare to a casual? From an observation of 10 players with experience ranging from a few to hundreds of games, success rates for open 20s in-game ranged from 25% to 60%."},{"type":"text","value":"The odds of two opponents making eight consecutive shots can vary greatly depending on their skill level. <strong>Here are the odds of a double perfect round.</strong>"},{"type":"Table","value":{"src":"odds","note":"Slater makes 75% and Reinman makes 66% on open 20s.","right":"1","highlight":"0"}},{"type":"text","value":"Our theoretical scenarios provide a good sense of the odds for witnessing this phenomenon. Surprisingly, even a slight drop in skill has a significant impact. To catch a glimpse of this rare event, we really need both of the world’s top players hitting a hot streak simultaneously."},{"type":"text","value":"It's important to note that all of these percentages are based on in-game attempts, where a player’s rhythm for open 20s is interrupted by various other types of shots. In isolation, their skills can be even more impressive. Take Shawn Hagarty, for instance, who recently set an unofficial world record by making 64 consecutive open 20s."},{"type":"Video","value":{"src":"assets/videos/record.mp4","preload":"true","autoplay":"true","muted":"true","loop":"true","restart":"true","figcaption":"64 straight open 20s by Shaw Hagarty. Watch on <a href=https://www.youtube.com/watch?v=Lmp_-1ifOPc target=_blank rel=noreferrer>YouTube</a>."}},{"type":"text","value":"However, real games are far more nuanced and complex. Players — or their opponents — often miss early on. Here's what the data reveals after analyzing 300 rounds from various matchups in last season’s tournaments."},{"type":"text","value":"<strong>At Which Shot an Open 20 is First Missed in Competitive Matches</strong>"},{"type":"Histogram","value":{"note":"Based on 300 rounds from final to quarterfinal matches in the past year."}},{"type":"text","value":"More often than not, the elusive double perfect round is lost right at the start. But I’ve been discussing this in the context of the most elegant form — a “pure” double perfect round, where all 16 shots are made as open 20s."},{"type":"text","value":"Technically, though, a miss doesn’t completely rule out a perfect round. A perfect round can (and often does) include a combination of open 20s and ricochet 20s, where a disc bounces in off the opponent’s."},{"type":"Video","value":{"src":"assets/videos/ricochet.mp4","preload":"true","autoplay":"true","muted":"true","loop":"true","restart":"true","figcaption":"Ricochet 20s by Justin Slater and Andrew Hutchinson. Watch on <a href=https://www.youtube.com/watch?v=Iyn64Sn_yqI target=_blank rel=noreferrer>YouTube</a>."}},{"type":"text","value":"This introduces more complex and exciting gameplay scenarios, as going for a 20 isn’t always the best strategic move."},{"type":"Video","value":{"src":"assets/videos/triple.mp4","preload":"true","autoplay":"true","muted":"true","loop":"true","restart":"true","figcaption":"Triple takeout by Nolan Tracey. Watch on <a href=https://www.youtube.com/watch?v=B3zaxfzEfXc target=_blank rel=noreferrer>YouTube</a>."}},{"type":"text","value":"One thing is certain: more skilled players tend to keep the board clear and make open 20s at a higher rate, increasing the likelihood of a pure double perfect round when two top players face off."},{"type":"text","value":"And no, Crokinole isn’t an Olympic sport — yet."},{"type":"text","value":"For more analysis, check out <a href=https://public.tableau.com/app/profile/shawn.hagarty/viz/NCACrokinole20sStats/NCAAll20s target=_blank rel=noreferrer>Shawn Hagarty’s visualizations.</a>"},{"type":"Method","value":{"text":[{"type":"text","value":"<strong>Data and Methods</strong>"},{"type":"text","value":"Player types are estimations based on all open 20 success rates from 2023-2024 NCA tournament data. Recreational open 20 success rates are based on observations of 600 open 20 attempts from 10 individuals with at least 50 attempts each."}]}}]}]}